export const UNIT_TYPE_흔함 = "흔함";
export const UNIT_TYPE_안흔함 = "안흔함";
export const UNIT_TYPE_특별함 = "특별함";

export const UNIT_TYPE_ID = {
  [UNIT_TYPE_흔함]: "00",
  [UNIT_TYPE_안흔함]: "01",
  [UNIT_TYPE_특별함]: "02"
};

export const UNIT_TYPE = {
  [UNIT_TYPE_ID[UNIT_TYPE_흔함]]: UNIT_TYPE_흔함,
  [UNIT_TYPE_ID[UNIT_TYPE_안흔함]]: UNIT_TYPE_안흔함,
  [UNIT_TYPE_ID[UNIT_TYPE_특별함]]: UNIT_TYPE_특별함
};

export const UNIT_SPRITE_IMAGE = {
  [UNIT_TYPE_ID.흔함]: "images/흔함.webp",
  [UNIT_TYPE_ID.안흔함]: "images/안흔함.webp",
  [UNIT_TYPE_ID.특별함]: "images/특별함.webp"
};

export const UNIT_IMAGE_SIZE = {
  WIDTH: 65,
  HEIGHT: 50
};

const 흔함 = {
  "0000": { name: "위습" },
  "0001": { name: "루피" },
  "0002": { name: "조로" },
  "0003": { name: "나미" },
  "0004": { name: "우솝" },
  "0005": { name: "상디" },
  "0006": { name: "쵸파" },
  "0007": { name: "버기" },
  "0008": { name: "총병" },
  "0009": { name: "칼병" }
};

const 안흔함 = {
  "0100": { name: "로빈", children: ["0003", "0005"] },
  "0101": { name: "베포", children: ["0006", "0001"] },
  "0102": { name: "브룩", children: ["0002", "0006"] },
  "0103": { name: "블루노", children: ["0008", "0008"] },
  "0104": { name: "에이스", children: ["0001", "0008"] },
  "0105": { name: "이나즈마", children: ["0005", "0002"] },
  "0106": { name: "저격왕", children: ["0004", "0004"] },
  "0107": { name: "쵸파럼블볼강화", children: ["0006", "0006"] },
  "0108": { name: "타시기", children: ["0009", "0008"] },
  "0109": { name: "페로나", children: ["0007", "0003"] },
  "0110": { name: "프랑키", children: ["0004", "0001"] },
  "0111": { name: "하찌", children: ["0008", "0003"] },
  "0112": { name: "후쿠로", children: ["0009", "0009"] }
};

const 특별함 = {
  "0200": { name: "X-드레이크", children: ["0108", "0112", "0006"] },
  "0201": { name: "갱 벳지", children: ["0112", "0008", "0007"] },
  "0202": { name: "나미 크리마텍트", children: ["0003", "0003", "0003"] },
  "0203": { name: "로빈 오하라", children: ["0100", "0100", "0006"] },
  "0204": { name: "로우", children: ["0101", "0108", "0007"] },
  "0205": { name: "루치", children: ["0112", "0100", "0001"] },
  "0206": { name: "루피 기어세컨드", children: ["0001", "0001", "0001"] },
  "0207": { name: "마르코", children: ["0103", "0104", "0005"] },
  "0208": { name: "모리아", children: ["0102", "0102", "0005"] },
  "0209": { name: "바질 호킨스", children: ["0109", "0103", "0004"] },
  "0210": { name: "버기 마기탄", children: ["0007", "0007", "0007"] },
  "0211": { name: "봉쿠레", children: ["0105", "0100", "0003"] },
  "0212": { name: "상디 검은다리", children: ["0005", "0005", "0005"] },
  "0213": { name: "스모커", children: ["0008", "0108", "0009"] },
  "0214": { name: "스쿼드", children: ["0107", "0110", "0003"] },
  "0215": { name: "아론", children: ["0111", "0111", "0001"] },
  "0216": { name: "압살롬", children: ["0005"] },
  "0217": { name: "에넬", children: ["0106", "0101", "0005"] },
  "0218": { name: "에이스 2번대대장", children: ["0104", "0104", "0004"] },
  "0219": { name: "우솝 화염탄", children: ["0106", "0106"] },
  "0220": { name: "이나즈마 혁명군", children: ["0105", "0105"] },
  "0221": { name: "조로 귀기", children: ["0002", "0002", "0002"] },
  "0222": { name: "징베", children: ["0104", "0112", "0007"] },
  "0223": { name: "챠카", children: ["0103", "0112", "0006"] },
  "0224": { name: "쵸파 가드포인트", children: ["0107", "0105", "0009"] },
  "0225": { name: "쵸파 두뇌강화", children: ["0107", "0100", "0007"] },
  "0226": { name: "캡틴크로", children: ["0111", "0009", "0002"] },
  "0227": { name: "쿠마", children: ["0101", "0110", "0002"] },
  "0228": { name: "크로커다일", children: ["0110", "0106", "0007"] },
  "0229": { name: "키드", children: ["0109", "0101", "0007"] },
  "0230": { name: "킬러", children: ["0108", "0102", "0007"] },
  "0231": { name: "파이러츠도킹5", children: ["0110", "0110", "0002"] },
  "0232": { name: "헤르메포", children: ["0102", "0002", "0005"] }
};

// const 희귀함 = {
//   ["X-드레이크"]: "X-드레이크",
//   ["거프"]: "거프",
//   ["검은수염"]: "검은수염",
//   ["도플라밍고"]: "도플라밍고",
//   ["로우"]: "로우",
//   ["루피 기어써드"]: "루피 기어써드",
//   ["류마"]: "류마",
//   ["마르코 불사조"]: "마르코 불사조",
//   ["마젤란"]: "마젤란",
//   ["모몬가"]: "모몬가",
//   ["미호크"]: "미호크",
//   ["바르토로메오"]: "바르토로메오",
//   ["바제스"]: "바제스",
//   ["바질 호킨스"]: "바질 호킨스",
//   ["반더데켄"]: "반더데켄",
//   ["베이비5"]: "베이비5",
//   ["벤 베크만"]: "벤 베크만",
//   ["브룩 음악가"]: "브룩 음악가",
//   ["비비"]: "비비",
//   ["사보"]: "사보",
//   ["상디 디아블잠브"]: "상디 디아블잠브",
//   ["샹크스"]: "샹크스",
//   ["센토마루"]: "센토마루",
//   ["슈가"]: "슈가",
//   ["시류"]: "시류",
//   ["아오키지"]: "아오키지",
//   ["아카이누"]: "아카이누",
//   ["오즈"]: "오즈",
//   ["와이퍼"]: "와이퍼",
//   ["우솝 보잉열도"]: "우솝 보잉열도",
//   ["이완코브"]: "이완코브",
//   ["제프"]: "제프",
//   ["조로 현상금 사냥꾼"]: "조로 현상금 사냥꾼",
//   ["죠즈"]: "죠즈",
//   ["쵸파 혼포인트"]: "쵸파 혼포인트",
//   ["카쿠"]: "카쿠",
//   ["캡틴 키드"]: "캡틴 키드",
//   ["크로커다일 MR.0"]: "크로커다일 MR.0",
//   ["키자루"]: "키자루",
//   ["킨에몬"]: "킨에몬",
//   ["페로나"]: "페로나",
//   ["핸콕"]: "핸콕"
// };

// const 전설적인 = {
//   ["검은수염"]: "검은수염",
//   ["나미"]: "나미",
//   ["네코마무시"]: "네코마무시",
//   ["드래곤"]: "드래곤",
//   ["라분"]: "라분",
//   ["레이쥬"]: "레이쥬",
//   ["레일리"]: "레일리",
//   ["로우"]: "로우",
//   ["루치"]: "루치",
//   ["루피 JET개틀링"]: "루피 JET개틀링",
//   ["루피 나이트메어"]: "루피 나이트메어",
//   ["마르코 환수종"]: "마르코 환수종",
//   ["모리아"]: "모리아",
//   ["바르토로메오"]: "바르토로메오",
//   ["상디"]: "상디",
//   ["샹크스"]: "샹크스",
//   ["센고쿠"]: "센고쿠",
//   ["슈가"]: "슈가",
//   ["스모커"]: "스모커",
//   ["시노부"]: "시노부",
//   ["시저"]: "시저",
//   ["시키"]: "시키",
//   ["에이스"]: "에이스",
//   ["울티"]: "울티",
//   ["제파"]: "제파",
//   ["조로 사자의노래"]: "조로 사자의노래",
//   ["징베"]: "징베",
//   ["카르가라"]: "카르가라",
//   ["코비"]: "코비",
//   ["쿠마 폭군"]: "쿠마 폭군",
//   ["크래커"]: "크래커",
//   ["킹"]: "킹",
//   ["토키"]: "토키",
//   ["핸콕"]: "핸콕",
//   ["후지토라"]: "후지토라",
//   ["흰수염"]: "흰수염",
//   ["히루루크"]: "히루루크"
// };

// const 히든 = {
//   ["검호 미호크"]: "검호 미호크",
//   ["레드포스호"]: "레드포스호",
//   ["레베카"]: "레베카",
//   ["료쿠규"]: "료쿠규",
//   ["류마"]: "류마",
//   ["모비딕호"]: "모비딕호",
//   ["반더데켄"]: "반더데켄",
//   ["발라티에"]: "발라티에",
//   ["방주맥심"]: "방주맥심",
//   ["베르고"]: "베르고",
//   ["봉쿠레"]: "봉쿠레",
//   ["사보"]: "사보",
//   ["시류"]: "시류",
//   ["써니호"]: "써니호",
//   ["아오키지"]: "아오키지",
//   ["아카이누"]: "아카이누",
//   ["이완코브"]: "이완코브",
//   ["캐럿"]: "캐럿",
//   ["코알라"]: "코알라",
//   ["킨에몬 여우불"]: "킨에몬 여우불",
//   ["킬러"]: "킬러",
//   ["페로나"]: "페로나",
//   ["피셔타이거"]: "피셔타이거"
// };

// const 랜덤제한 = {
//   ["료우기 시키"]: "료우기 시키",
//   ["미나토"]: "미나토",
//   ["뱌쿠야"]: "뱌쿠야",
//   ["부릉냐"]: "부릉냐",
//   ["야쿠모 유카리"]: "야쿠모 유카리",
//   ["쿠죠 죠타로"]: "쿠죠 죠타로",
//   ["키쿄우"]: "키쿄우",
//   ["타츠마키"]: "타츠마키",
//   ["히그마"]: "히그마"
// };

// const 변화된 = {
//   ["도플라밍고"]: "도플라밍고",
//   ["베이비5"]: "베이비5",
//   ["비비"]: "비비",
//   ["에이스"]: "에이스",
//   ["캐럿 스론"]: "캐럿 스론"
// };

// const 제한됨 = {
//   ["레드필드"]: "레드필드",
//   ["레베카"]: "레베카",
//   ["시노부"]: "시노부",
//   ["아인"]: "아인",
//   ["에넬"]: "에넬",
//   ["카타쿠리"]: "카타쿠리",
//   ["크로커다일"]: "크로커다일",
//   ["킹"]: "킹"
// };

// const 초월함 = {
//   ["검은수염"]: "검은수염",
//   ["나미"]: "나미",
//   ["도플라밍고"]: "도플라밍고",
//   ["로빈"]: "로빈",
//   ["로우"]: "로우",
//   ["루치"]: "루치",
//   ["루피"]: "루피",
//   ["바질 호킨스"]: "바질 호킨스",
//   ["브룩"]: "브룩",
//   ["사보"]: "사보",
//   ["상디"]: "상디",
//   ["샹크스"]: "샹크스",
//   ["스네이크맨"]: "스네이크맨",
//   ["시라호시"]: "시라호시",
//   ["아오키지"]: "아오키지",
//   ["아카이누"]: "아카이누",
//   ["야마토"]: "야마토",
//   ["우솝"]: "우솝",
//   ["조로"]: "조로",
//   ["징베"]: "징베",
//   ["쵸파"]: "쵸파",
//   ["키드"]: "키드",
//   ["키자루"]: "키자루",
//   ["타시기"]: "타시기",
//   ["프랑키"]: "프랑키",
//   ["후지토라"]: "후지토라"
// };

// const 불멸의 = {
//   ["거프"]: "거프",
//   ["드래곤"]: "드래곤",
//   ["레일리"]: "레일리",
//   ["로져"]: "로져",
//   ["빅맘"]: "빅맘",
//   ["센고쿠"]: "센고쿠",
//   ["스코퍼 가반"]: "스코퍼 가반",
//   ["시키"]: "시키",
//   ["제트"]: "제트",
//   ["카이도"]: "카이도",
//   ["흰수염"]: "흰수염"
// };

// const 영원함 = {
//   ["미호크"]: "미호크",
//   ["버기"]: "버기",
//   ["비비"]: "비비",
//   ["에이스"]: "에이스",
//   ["오뎅"]: "오뎅",
//   ["카번딧슈"]: "카번딧슈",
//   ["핸콕"]: "핸콕"
// };

export const UNIT = {
  흔함,
  안흔함,
  특별함
};
